cask_args appdir: "/Applications"
tap "homebrew/cask"

brew "imagemagick"
brew "git"
brew "bash"
brew "zsh"
brew "macvim", args: ["--with-override-system-vim"]

brew "mongodb@3.0"
brew "elasticsearch@2.4"
brew "postgresql"
brew "redis"
brew "sqlite"

brew "scala"
brew "pyenv"
brew "nvm"
brew "rbenv"

brew "heroku"
brew "watchman"
brew "exercism"


cask "google-chrome"
cask "visual-studio-code"
cask "slack"
cask "firefox", args: { appdir: "~/Applications" }
cask "intellij-idea-ce"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "1Password"
cask "backblaze"
cask "dropbox"
cask "google-backup-and-sync"
cask "bartender"
cask "alfred"
cask "spectacle"
cask "bettertouchtool"
cask "grandperspective"
cask "iterm2"
cask "jasper"
cask "appcleaner"
cask "audacity"
cask "skype"
cask "spotify"

# Docker/for mac?