autoconf
bash
boost
cask
composer
emacs
exercism
freetype
gdbm
gettext
git
icu4c
jpeg
libpng
libxml2
mcrypt
mhash
mysql
node
openssl
php56
php56-mcrypt
phpunit
pkg-config
postgresql
python
rbenv
readline
ruby-build
sqlite
unixodbc
